feco9308/agopen-rate-can-ecu/firmware/stm32g-node/STM32G_node/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_HEARTBEAT_Pin GPIO_PIN_6
#define LED_HEARTBEAT_GPIO_Port GPIOC
#define DRV8301_CS_Pin GPIO_PIN_4
#define DRV8301_CS_GPIO_Port GPIOA
#define DRV8301_nFAULT_Pin GPIO_PIN_0
#define DRV8301_nFAULT_GPIO_Port GPIOB
#define DRV8301_EN_GATE_Pin GPIO_PIN_12
#define DRV8301_EN_GATE_GPIO_Port GPIOB
#define AS5048A_CS_Pin GPIO_PIN_10
#define AS5048A_CS_GPIO_Port GPIOB
#define HALL_A_Pin GPIO_PIN_6
#define HALL_A_GPIO_Port GPIOB
#define HALL_B_Pin GPIO_PIN_7
#define HALL_B_GPIO_Port GPIOB
#define HALL_C_Pin GPIO_PIN_11
#define HALL_C_GPIO_Port GPIOB
#define MOTOR_PWM_AH_Pin GPIO_PIN_8
#define MOTOR_PWM_AH_GPIO_Port GPIOA
#define MOTOR_PWM_BH_Pin GPIO_PIN_9
#define MOTOR_PWM_BH_GPIO_Port GPIOA
#define MOTOR_PWM_CH_Pin GPIO_PIN_10
#define MOTOR_PWM_CH_GPIO_Port GPIOA
#define MOTOR_PWM_AL_Pin GPIO_PIN_13
#define MOTOR_PWM_AL_GPIO_Port GPIOB
#define MOTOR_PWM_BL_Pin GPIO_PIN_14
#define MOTOR_PWM_BL_GPIO_Port GPIOB
#define MOTOR_PWM_CL_Pin GPIO_PIN_15
#define MOTOR_PWM_CL_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
